export default {
    aboutMe: "Обо мне",
    contacts: "Контакты",
    contactMe: "Свяжитесь со мной",
    technologyStack: "Стек технологий",
    myProjects: "Мои проекты",
    myStack: "Мой основной стэк",

    aboutBlock: {
        descriptionName: 'Привет, меня зовут Демежан, я Vue.js frontend-разработчик',
        currentWork: 'На данный момент, работаю в',
        description: 'Мне нравится работать с новыми технологиями фронтенда и я пытаюсь следовать лучшим практикам в своем коде',

        descriptionHobbies: 'Вне программирования я занимаюсь написанием музыки, плаванием, путешествиями и играю в компьютерные игры',
        descriptionLocation: 'На данный момент живу в городе 📍Астана.',
        descriptionPostion: 'Vue.js Frontend-разработчик',
    },

    projectsBlock: {
        uiLibCustom: 'Верстка экранов по макету с помощью кастомной UI-библиотеки',
        uiLibAntd: 'Верстка экранов по дизайну с помощью UI-библиотеки (Ant-design-vue)',
        moveVueVersions: 'Перенос проекта с Vue 2 на Vue 3',
        utilityPoint: 'Вклад в создание Набора утилит для упрощения работы',
        websocketsNca: 'Работа с WebSockets (NCALayer)',
        perfomanceBoost: 'Внес вклад в повышение перфоманса приложения',
        fromScratch: 'Проект был написан мной с нуля',
        capacitorBuild: 'Билд Android и IOS приложения с помощью Capacitor',
        improvedSeo: 'Улучшил SEO показатели сайта до максимума',
        modularFsd: 'В качестве архитектуры использовал смесь FSD и Modular',
        codeReview: 'Проводил code-review',
        improvedPerfomance: 'Улучшил производительность',
        patternsUsed: 'Использовал паттерны проектирования',

        tanbalau: {
            description: 'Внутренняя CRM-система для упрощения маркировки товаров #1',
        },
        forte: {
            title: 'Forte - Кабинет оценщика',
            description: 'Внутренняя CRM-система банка',
            jsonStructure: 'Имплементировал кастомное решение по генерации отчетов из json структуры',
        },
        agro: {
            description: 'Казахстанский маркетплейс зерновых культур',
        },
        saveit: {
            description: 'CRM система для добавления продукции',
        },
        egistic: {
            description: 'Система управления хозяйством',
            workWithMaps: 'Работа с картами',
            websocketsUsage: 'Работа с WebSockets (Слежка за техникой в режиме реального времени)',
            vueToNuxt: 'Переписал проект с Vue 2 на Nuxt 3',
            mentoringCount: 'Менторил команду из 2х разработчиков',
        }
    }
}